---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesTopDirn1
source: html/76391a3e-fede-74d4-331b-b4aef36f32b4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesTopDirn1 Property

"Top Major Number Of Lines"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemNumberOfLinesTopDirn1 { get; }
```